---
layout: single
title:  "20220728 SQL / 리트코드, 해커랭크"
categories: data_it_girls
---

# 595. Big Countries

A country is big if:

- it has an area of at least three million (i.e., 3000000 km2), or
- it has a population of at least twenty-five million (i.e., 25000000).

Write an SQL query to report the name, population, and area of the big countries.

Return the result table in any order.

The query result format is in the following example.

In [ ]:
SELECT name, population, area
FROM World
WHERE area >= 3000000 OR population >= 25000000

# 620. Not Boring Movies

Write an SQL query to report the movies with an odd-numbered ID and a description that is not "boring".

Return the result table ordered by rating in descending order.

The query result format is in the following example.

In [ ]:
SELECT id, movie, description, rating
FROM Cinema
WHERE description <> 'boring' AND id IN (SELECT id 
                                           FROM Cinema 
                                           WHERE MOD(id, 2) = 1) # WHERE MOD(a, b) : a를 b로 나눈 나머지
ORDER BY rating DESC

# 182. Duplicate Emails

Write an SQL query to report all the duplicate emails.

Return the result table in any order.

The query result format is in the following example.

In [ ]:
SELECT email
FROM Person
GROUP BY email
HAVING COUNT(id) > 1

# 175. Combine Two Tables

Write an SQL query to report the first name, last name, city, and state of each person in the `Person` table. If the address of a `personId` is not present in the `Address` table, report `null` instead.

Return the result table in any order.

The query result format is in the following example.

In [ ]:
SELECT p.firstName, p.lastName, a.city, a.state
FROM Person AS p LEFT JOIN Address AS a ON p.personId = a.personId

# Aggregation > Japan Population

Query the sum of the populations for all Japanese cities in CITY. The COUNTRYCODE for Japan is JPN.

In [ ]:
SELECT SUM(POPULATION)
FROM CITY
WHERE COUNTRYCODE = 'JPN'

# Aggregation > Weather Observation Station 2

Query the following two values from the STATION table:

The sum of all values in LAT_N rounded to a scale of 2 decimal places.
The sum of all values in LONG_W rounded to a scale of 2 decimal places.

In [ ]:
SELECT ROUND(SUM(LAT_N), 2), ROUND(SUM(LONG_W), 2)
FROM STATION

# Aggregation > Weather Observation Station 18

Consider p1(a,b) and p2(c,d) to be two points on a 2D plane.

- a happens to equal the minimum value in Northern Latitude (LAT_N in STATION).
- b happens to equal the minimum value in Western Longitude (LONG_W in STATION).
- c happens to equal the maximum value in Northern Latitude (LAT_N in STATION).
- d happens to equal the maximum value in Western Longitude (LONG_W in STATION).

Query the Manhattan Distance between points p1 and p2 and round it to a scale of 4 decimal places.

In [ ]:
SELECT ROUND(ABS(MAX(LAT_N) - MIN(LAT_N)) + ABS(MAX(LONG_W) - MIN(LONG_W)), 4)
FROM STATION

# Advanced Select > New Companies

Amber's conglomerate corporation just acquired some new companies. Each of the companies follows this hierarchy: 

Given the table schemas below, write a query to print the company_code, founder name, total number of lead managers, total number of senior managers, total number of managers, and total number of employees. Order your output by ascending company_code.

Note:

- The tables may contain duplicate records.
- The company_code is string, so the sorting should not be numeric. For example, if the company_codes are C_1, C_2, and C_10, then the ascending company_codes will be C_1, C_10, and C_2.

In [ ]:
SELECT C.company_code, C.founder, COUNT(DISTINCT E.lead_manager_code),
    COUNT(DISTINCT E.senior_manager_code), COUNT(DISTINCT E.manager_code), 
    COUNT(DISTINCT E.employee_code)
FROM Employee E LEFT JOIN Company C ON C.company_code = E.company_code
GROUP BY C.company_code, C.founder
ORDER BY C.company_code

# Aggregation > Population Density Difference

Query the difference between the maximum and minimum populations in CITY.

In [ ]:
SELECT MAX(POPULATION) - MIN(POPULATION)
FROM CITY

# Basic Select > Weather Observation Station 11

Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT CITY
FROM STATION
WHERE LEFT(CITY, 1) NOT IN ('a','e','i','o','u') OR 
    RIGHT(CITY, 1) NOT IN ('a','e','i','o','u')

# Aggregation > Weather Observation Station 13

Query the sum of Northern Latitudes (LAT_N) from STATION having values greater than 38.7880 and less than 137.2345. Truncate your answer to 4 decimal places.

In [ ]:
SELECT ROUND(SUM(LAT_N), 4)
FROM STATION
WHERE LAT_N > 38.7880 AND LAT_N < 137.2345

# Basic Join > Top Competitors

Julia just finished conducting a coding contest, and she needs your help assembling the leaderboard! Write a query to print the respective hacker_id and name of hackers who achieved full scores for more than one challenge. Order your output in descending order by the total number of challenges in which the hacker earned a full score. If more than one hacker received full scores in same number of challenges, then sort them by ascending hacker_id.

In [ ]:
SELECT T.HID, T.NAME
FROM(SELECT S.submission_id SID, S.hacker_id HID, S.challenge_id CID, 
            S.score SCORE, D.score PERFECT, H.name NAME
    FROM Submissions S, Challenges C, Difficulty D, Hackers H
    WHERE S.challenge_id = C.challenge_id 
         AND C.difficulty_level = D.difficulty_level
         AND S.hacker_id = H.hacker_id) AS T
WHERE T.SCORE = T.PERFECT
GROUP BY T.HID, T.NAME
HAVING COUNT(T.CID) > 1
ORDER BY COUNT(T.SID) DESC, T.HID

# Basic Select > Weather Observation Station 3

Query a list of CITY names from STATION for cities that have an even ID number. Print the results in any order, but exclude duplicates from the answer.

In [ ]:
SELECT DISTINCT CITY
FROM STATION
WHERE MOD(ID, 2) = 0

# Aggregation > Weather Observation Station 19

Consider P1(a,c) and P1(b,d) to be two points on a 2D plane where (a,b) are the respective minimum and maximum values of Northern Latitude (LAT_N) and (c,d) are the respective minimum and maximum values of Western Longitude (LONG_W) in STATION.

Query the Euclidean Distance between points P1 and P2 and format your answer to display 4 decimal digits.

In [ ]:
SELECT ROUND(SQRT(POWER(MAX(LONG_W) - MIN(LONG_W), 2) + POWER(MAX(LAT_N) - MIN(LAT_N), 2)), 4)
FROM STATION

# Advanced Join > Placements

You are given three tables: Students, Friends and Packages. Students contains two columns: ID and Name. Friends contains two columns: ID and Friend_ID (ID of the ONLY best friend). Packages contains two columns: ID and Salary (offered salary in $ thousands per month).

Write a query to output the names of those students whose best friends got offered a higher salary than them. Names must be ordered by the salary amount offered to the best friends. It is guaranteed that no two students got same salary offer.

In [ ]:
SELECT S.Name
FROM Packages AS P LEFT JOIN Students AS S ON P.ID = S.ID
    LEFT JOIN Friends AS F ON P.ID = F.ID
    LEFT JOIN Packages AS P1 ON F.Friend_ID = P1.ID
WHERE P.Salary < P1.Salary
ORDER BY P1.Salary

# Advanced Select > Binary Tree Nodes

You are given a table, BST, containing two columns: N and P, where N represents the value of a node in Binary Tree, and P is the parent of N.

Write a query to find the node type of Binary Tree ordered by the value of the node. Output one of the following for each node:

- Root: If node is root node.
- Leaf: If node is leaf node.
- Inner: If node is neither root nor leaf node.

In [ ]:
SELECT N,
    CASE
        WHEN P IS NULL THEN 'Root'
        WHEN N IN (SELECT P FROM BST) THEN 'Inner'
        ELSE 'Leaf'
    END RESULT
FROM BST
ORDER BY N

# Aggregation > Weather Observation Station 17

Query the Western Longitude (LONG_W)where the smallest Northern Latitude (LAT_N) in STATION is greater than 38.7780. Round your answer to 4 decimal places.

In [ ]:
SELECT ROUND(LONG_W, 4)
FROM STATION
WHERE LAT_N = (SELECT MIN(LAT_N)
                FROM STATION
                WHERE LAT_N > 38.7780)

# Basic Join > Contest Leaderboard

You did such a great job helping Julia with her last coding contest challenge that she wants you to work on this one, too!

The total score of a hacker is the sum of their maximum scores for all of the challenges. Write a query to print the hacker_id, name, and total score of the hackers ordered by the descending score. If more than one hacker achieved the same total score, then sort the result by ascending hacker_id. Exclude all hackers with a total score of 0 from your result.

# Advanced Select > Occupations

Pivot the Occupation column in OCCUPATIONS so that each Name is sorted alphabetically and displayed underneath its corresponding Occupation. The output column headers should be Doctor, Professor, Singer, and Actor, respectively.

Note: Print NULL when there are no more names corresponding to an occupation.

# Basic Select > Weather Observation Station 5

Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

In [ ]:
SELECT CITY, LENGTH(CITY)
FROM STATION
WHERE LENGTH(CITY) = (SELECT MIN(T.LEN)
                        FROM (SELECT CITY, LENGTH(CITY) AS LEN
                                FROM STATION) T) 
ORDER BY CITY
LIMIT 1;

SELECT CITY, LENGTH(CITY)
FROM STATION
WHERE LENGTH(CITY) = (SELECT MAX(T.LEN)
                        FROM (SELECT CITY, LENGTH(CITY) AS LEN
                                FROM STATION) T) 
ORDER BY CITY
LIMIT 1;

# Advanced Join > SQL Project Planning

You are given a table, Projects, containing three columns: Task_ID, Start_Date and End_Date. It is guaranteed that the difference between the End_Date and the Start_Date is equal to 1 day for each row in the table.



If the End_Date of the tasks are consecutive, then they are part of the same project. Samantha is interested in finding the total number of different projects completed.

Write a query to output the start and end dates of projects listed by the number of days it took to complete the project in ascending order. If there is more than one project that have the same number of completion days, then order by the start date of the project.

# Basic Join > Ollivander's Inventory

Harry Potter and his friends are at Ollivander's with Ron, finally replacing Charlie's old broken wand.

Hermione decides the best way to choose is by determining the minimum number of gold galleons needed to buy each non-evil wand of high power and age. Write a query to print the id, age, coins_needed, and power of the wands that Ron's interested in, sorted in order of descending power. If more than one wand has same power, sort the result in order of descending age.

# Aggregation > Weather Observation Station 20

A median is defined as a number separating the higher half of a data set from the lower half. Query the median of the Northern Latitudes (LAT_N) from STATION and round your answer to  decimal places.

In [ ]:
SELECT T.LAT
FROM (SELECT ROW_NUMBER() OVER(ORDER BY LAT_N) RN, ROUND(LAT_N, 4) AS LAT
        FROM STATION) AS T
WHERE T.RN = (SELECT CEIL(COUNT(LAT_N) / 2)
                FROM STATION)

# 178. Rank Scores

Write an SQL query to rank the scores. The ranking should be calculated according to the following rules:

- The scores should be ranked from the highest to the lowest.
- If there is a tie between two scores, both should have the same ranking.
- After a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no holes between ranks.

Return the result table ordered by score in descending order.

In [ ]:
SELECT score, DENSE_RANK() over(ORDER BY score DESC) AS 'rank'
FROM Scores

# 262. Trips and Users

The cancellation rate is computed by dividing the number of canceled (by client or driver) requests with unbanned users by the total number of requests with unbanned users on that day.

Write a SQL query to find the cancellation rate of requests with unbanned users (both client and driver must not be banned) each day between "2013-10-01" and "2013-10-03". Round Cancellation Rate to two decimal points.

Return the result table in any order.

In [ ]:
SELECT T1.day AS 'Day', ROUND(T2.canceled / T1.total, 2) AS 'Cancellation Rate'
FROM 
(SELECT T.request_at AS day, COUNT(id) AS total
        FROM Trips AS T LEFT JOIN Users AS U ON T.client_id = U.users_id
        WHERE U.banned = 'No'
        GROUP BY T.request_at) AS T1,
(SELECT T.request_at AS day, IFNULL(COUNT(id), 0.00) AS canceled
    FROM Trips AS T LEFT JOIN Users AS U ON T.client_id = U.users_id
    WHERE U.banned = 'No' AND T.status <> 'completed'
    GROUP BY T.request_at) AS T2
WHERE T1.day = T2.day

# 626. Exchange Seats

Write an SQL query to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

Return the result table ordered by id in ascending order.